УТ_для_edt/src/Catalogs/смартАлгоритмыПроверки/смартАлгоритмыПроверки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>смартАлгоритмыПроверки</name>
  <comment>#Б-3164 смарт: Лопато 20.05.2025 //Печать договора из Заказа клиента. Функциональное описание новой обработки.</comment>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВыражениеУсловия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаКомбинацииУсловий</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаУсловия</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеОтбора</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособЗаданияУсловия</name>
    <type>
      <types>EnumRef.смартСпособыЗаданияУсловия</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъекта</name>
    <type>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Параметры</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/Catalogs/смартАлгоритмыПроверки/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает структуру полей алгоритма проверки
//
// Возвращаемое значение:
//   Структура
//     Наименование
//     ТипОбъекта
//     СпособЗаданияУсловия
//     ВыражениеУсловия
//     НастройкаУсловия
//     НастройкаКомбинацииУсловий
//     Ответственный
//     Комментарий
//
Функция ПолучитьСтруктуруАлгоритмаПроверки() Экспорт
	
	СтруктураАлгоритмаПроверки = Новый Структура;
	СтруктураАлгоритмаПроверки.Вставить("Наименование");
	СтруктураАлгоритмаПроверки.Вставить("ТипОбъекта");
	СтруктураАлгоритмаПроверки.Вставить("СпособЗаданияУсловия");
	СтруктураАлгоритмаПроверки.Вставить("ВыражениеУсловия");
	СтруктураАлгоритмаПроверки.Вставить("НастройкаУсловия");
	СтруктураАлгоритмаПроверки.Вставить("НастройкаКомбинацииУсловий");
	СтруктураАлгоритмаПроверки.Вставить("Ответственный");
	СтруктураАлгоритмаПроверки.Вставить("Комментарий");
	
	Возврат СтруктураАлгоритмаПроверки;
	
КонецФункции

// Создает и запсывает в БД алгоритм проверки
//
// Параметры:
//   СтруктураАлгоритмыПроверки - Структура - структура полей алгоритма проверки.
//
// Возвращаемое значение:
//   СправочникСсылка.АлгоритмыПроверки
//
Функция СоздатьАлгоритмПроверки(СтруктураАлгоритмыПроверки) Экспорт
	
	НовыйАлгоритмПроверки = СоздатьЭлемент();
	ЗаполнитьЗначенияСвойств(НовыйАлгоритмПроверки, СтруктураАлгоритмыПроверки);
	НовыйАлгоритмПроверки.Записать();
	
	Возврат НовыйАлгоритмПроверки.Ссылка;
	
КонецФункции

// Возвращает выражение для выполнения проверки условия
// 
// Параметры:
// 	Условие - СправочникСсылка.АлгоритмыПроверки, ДанныеФормыСтруктура - ссылка, или проверяемое условие.
// 	
// Возвращаемое значение:
// 	Строка - выражение для выполнения проверки условия
//
Функция ПолноеВыражениеУсловия(Условие, РеквизитыУсловия = Неопределено) Экспорт
	
	МассивВыражений = Новый Массив;
	
	РеквизитыУсловия = Условие;
	Если ТипЗнч(Условие) = Тип("СправочникСсылка.смартАлгоритмыПроверки")
		И РеквизитыУсловия = Неопределено Тогда
		РеквизитыУсловия = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			Условие, "ВыражениеУсловия, Параметры");
		РеквизитыУсловия.Параметры = РеквизитыУсловия.Параметры.Выгрузить();
	КонецЕсли;
	
	Для Каждого СтрокаПараметра Из РеквизитыУсловия.Параметры Цикл
		Если СтрокаПараметра.Значение = Неопределено Тогда
			ВыражениеЗначения = "Неопределено";
		Иначе
			МетаданныеЗначения = СтрокаПараметра.Значение.Метаданные();
			Менеджер = ОбщегоНазначения.ИмяБазовогоТипаПоОбъектуМетаданных(МетаданныеЗначения) + "." + МетаданныеЗначения.Имя;
			Если ОбщегоНазначения.ЭтоСправочник(МетаданныеЗначения)
				И СтрокаПараметра.Значение.Предопределенный Тогда
				ВыражениеЗначения = СтрШаблон("%1.%2",
					Менеджер, СтрокаПараметра.Значение.ИмяПредопределенныхДанных);
			Иначе
				Идентификатор = Строка(СтрокаПараметра.Значение.УникальныйИдентификатор());
				ВыражениеЗначения = СтрШаблон("%1.ПолучитьСсылку(Новый УникальныйИдентификатор(""%2""))",
					Менеджер, Идентификатор);
			КонецЕсли;
		КонецЕсли;
		МассивВыражений.Добавить(СтрШаблон("%1 = %2;", СтрокаПараметра.Имя, ВыражениеЗначения));
	КонецЦикла;
	
	МассивВыражений.Добавить(РеквизитыУсловия.ВыражениеУсловия);
	
	Возврат СтрСоединить(МассивВыражений, Символы.ПС);
	
КонецФункции

#КонецОбласти

#КонецЕсли
